DataProcessors/ФорматУниверсальноеСообщениеЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ФорматУниверсальноеСообщениеЭДО</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектXDTO</Name>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ТипыЭлементовРегламентаЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЭлементовРегламентаЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВложениеЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСведенияПоРезультатамПриемки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСведенияПоРезультатамПриемки_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСведенияПоРезультатамПриемки_ПДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДопСведенияПоРезультатамПриемки_ПДП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияОтправителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияПолучателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияПолучателя_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияПолучателя_ПДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияПолучателя_ПДП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнформацияПолучателя_ПДП_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИОП_ПДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИОП_ПДП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИОП_ПДП_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КвитанцияЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрактЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПДО_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПДП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПДП_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПОА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПОА_УОУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриложениеУКДДляЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриложениеУКДПокупателяДляЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриложениеУПДДляЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриложениеУПДПокупателяДляЕИС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьАктЗаказчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьДИСУКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьДОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьДополнительныйЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьДОПУПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьИнформацияПокупателяУКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьИнформацияПокупателяУПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьИПЭСФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьКСЧФДИСУКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьКСЧФУКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПДОЭСФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПДПЭСФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПервичныйЭД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьСоглашениеОбИзмененииСтоимостиПолучатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьСЧФДОПУПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьСЧФУПД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьТОРГ12Покупатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУУЭСФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЭСФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УОПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УОУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УОУ_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УОУ_ПДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УОУ_ПДП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДФ_ОткФщ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДФ_Титул1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДФ_Титул1_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДФ_Титул2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗЗ_Титул1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗЗ_Титул2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН_ОткФщ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН_Титул1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН_Титул1_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН_Титул2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН_Титул3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭЗН_Титул4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ_ОткМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ_Титул1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ_Титул2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ_Титул3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ_Титул4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ_Титул5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭПЛ_Титул6</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул1_1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул1_2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул1_3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул1_4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул1_5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул2_1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул2_2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул3_1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭСВ_Титул3_2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_ДопТитул3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_ДопТитул4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_ДопТитул7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_ДопТитул8</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_ДопТитул9</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_ОткГО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_ОткП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_ОткТ3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул1_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул3_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул5_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул6</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул8</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭТрН_Титул9</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УС_ИОП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УС_УОУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УС_ОтказВПодписи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УС_ДополнительнаяИнформация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ФорматУниверсальноеСообщениеЭДО/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ДатаФормирования; // Дата

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращаемое значение:
//  Массив Из см. ОбщегоНазначенияБЭДКлиентСервер.НовыеПараметрыОшибки
//
Функция ПолучитьОшибкиЗаполнения() Экспорт
	Возврат Новый Массив;
КонецФункции

// Параметры:
//  СоответствиеНоменклатуры - см. СопоставлениеНоменклатурыКонтрагентов.НайтиСоответствиеНоменклатуры
//
Процедура ЗаполнитьДанныеСопоставления(СоответствиеНоменклатуры) Экспорт

КонецПроцедуры

// Возвращаемое значение:
//  Соответствие Из КлючИЗначение:
//  * Ключ - см. СопоставлениеНоменклатурыКонтрагентов.ИдентификаторНоменклатурыКонтрагентаПоНатуральнымКлючам
//  * Значение - см. ФорматыЭДО.НовыеДанныеДляСопоставленияТоваров
//
Функция СтрокиТребующиеСопоставления() Экспорт
	
	Возврат Новый Соответствие;

КонецФункции

// Параметры:
//  ДополнительныеДанные - см. ФорматыЭДО.НовыеДанныеДляФормированияОсновногоТитула 
//
Процедура УстановитьДополнительныеДанныеДляФормирования(ДополнительныеДанные) Экспорт

КонецПроцедуры

#Область ФормированиеЭлектронногоДокумента

// Параметры:
//  ДанныеДляФормирования - см. ФорматыЭДО.НовыеДанныеДляФормированияСлужебногоСообщения
// 
// Возвращаемое значение:
//  Строка - Идентификатор файла
Функция ИдентификаторФайла(ДанныеДляФормирования)
	
	ДанныеШаблона = Новый Структура;
	ДанныеШаблона.Вставить("ТипФайла", "DP_UNISOOBSCH");
	ДанныеШаблона.Вставить("Получатель", ДанныеДляФормирования.Участники.Получатель.Абонент.Идентификатор);
	ДанныеШаблона.Вставить("Отправитель", ДанныеДляФормирования.Участники.Отправитель.Идентификатор);
	ДанныеШаблона.Вставить("Дата", Формат(ДатаФормирования, "ДФ=yyyyMMdd"));
	ДанныеШаблона.Вставить("УникальныйИдентификатор", ДанныеДляФормирования.УникальныйИдентификатор);
	
	Возврат СтроковыеФункцииКлиентСервер.ВставитьПараметрыВСтроку(
		"[ТипФайла]_[Получатель]_[Отправитель]_[Дата]_[УникальныйИдентификатор]", ДанныеШаблона);

КонецФункции

// Возвращаемое значение:
//  Строка - Пространство имен по данным формата
//
Функция ПространствоИмен() Экспорт
	Возврат "DP_UNISOOBSCH_1_982_02_05_01_01";
КонецФункции

// Параметры:
//  ДанныеДляФормирования - см. ФорматыЭДО.НовыеДанныеДляФормированияСлужебногоСообщения
Процедура ЗаполнитьОбъектXDTO(ДанныеДляФормирования) Экспорт 
	
	Файл = НовыйXDTOОбъект();
	
	Идентификатор = ИдентификаторФайла(ДанныеДляФормирования);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Файл, "ИдФайл", Идентификатор, Истина);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Файл, "ВерсПрог", ДанныеДляФормирования.ВерсияПрограммы, Истина);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Файл, "ВерсФорм", "5.01", Истина);

	ДокументУС = ДокументУС(ДанныеДляФормирования);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(Файл, "Документ", ДокументУС, Истина);
	ОбъектXDTO = Файл;
КонецПроцедуры

// Возвращаемое значение:
//  См. РаботаСФайламиБЭДКлиентСервер.НовоеОписаниеФайла
Функция СформироватьФайл() Экспорт
	ПространствоИмен = ПространствоИмен();
	
	Результат = РаботаСФайламиБЭДКлиентСервер.НовоеОписаниеФайла();
	
	ДвоичныеДанные = РаботаСФайламиБЭД.XDTOВДвоичныеДанные(ОбъектXDTO, Ложь, , "Файл");
	Результат.ДвоичныеДанные = ОбщегоНазначенияБЭД.УдалитьПространствоИмен(ДвоичныеДанные, ПространствоИмен);
	Результат.ИмяФайла = СтрШаблон("%1.%2", ОбъектXDTO.ИдФайл, "xml");
	
	Возврат Результат; 
КонецФункции

// Свойства универсального сообщения.
// 
// Возвращаемое значение:
//  Структура - Свойства универсального сообщения:
// * ИмяФайлаНазначения - Строка 
// * ТекстСообщения - Строка
// * Статус - Строка 
Функция СвойстваУниверсальногоСообщения() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("ИмяФайлаНазначения", РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(ОбъектXDTO, "Документ.СведУС.ИмяПолФайл"));
	Результат.Вставить("ТекстСообщения", РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(ОбъектXDTO, "Документ.СвСобытДок.ТекстУС"));
	Результат.Вставить("Статус", РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(ОбъектXDTO, "Документ.СвСобытДок.СтатусУС"));
	
	Возврат Результат;
КонецФункции 

// Возвращаемое значение:
//  Дата
Функция ДатаИВремяФормирования() Экспорт

	ДатаСтрокой = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(ОбъектXDTO, "Документ.СведУС.ДатаФорм");
	ВремяСтрокой = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(ОбъектXDTO, "Документ.СведУС.ВремФорм");
	ДатаИВремяОтправкиСтрокой = СтрШаблон("%1 %2", ДатаСтрокой, ВремяСтрокой);
	Результат = ОбщегоНазначенияБЭДКлиентСервер.ПолучитьДатуВремяИзСтроки(ДатаИВремяОтправкиСтрокой);
	
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДокументУС(ДанныеДляФормирования)

	ДокументУС = ПолучитьXDTOОбъект(АнонимныйТип("Файл.Документ"));
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДокументУС, "КНД", "1115144", Истина);
	
	СведУС = СведУС(ДанныеДляФормирования);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДокументУС, "СведУС", СведУС, Истина);
	
	СвСобытДок = СвСобытДок(ДанныеДляФормирования);
	ДокументУС.СвСобытДок.Добавить(СвСобытДок);
	
	ОтпрУС = ОтпрУС(ДанныеДляФормирования);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДокументУС, "ОтпрУС", ОтпрУС, Истина);
	
	ПолучУС = ПолучУС(ДанныеДляФормирования);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ДокументУС, "ПолучУС", ПолучУС, Истина);

	Возврат ДокументУС; 

КонецФункции

Функция СведУС(ДанныеДляФормирования)

	СведУС = ПолучитьXDTOОбъект(АнонимныйТип("Файл.Документ.СведУС"));
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведУС, "ДатаФорм", Формат(ДатаФормирования, "ДФ=dd.MM.yyyy"), Истина);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведУС, "ВремФорм", Формат(ДатаФормирования, "ДФ=HH.mm.ss"), Истина); 
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СведУС, "ИмяПолФайл", ДанныеДляФормирования.Основание.ИмяБезРасширения, Истина);
	
	Возврат СведУС;

КонецФункции

Функция СвСобытДок(ДанныеДляФормирования)
	
	СвСобытДок = ПолучитьXDTOОбъект(АнонимныйТип("Файл.Документ.СвСобытДок"));
	СоответствиеЭлементовРегламентаТипуУС = СоответствиеЭлементаРегламентаТипуУС();
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвСобытДок, 
		"СтатусУС", 
		СоответствиеЭлементовРегламентаТипуУС[ДанныеДляФормирования.ТипЭлементаРегламента], 
		Истина);
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(СвСобытДок, "ТекстУС", ДанныеДляФормирования.ТекстУточнения);
	
	Возврат СвСобытДок;

КонецФункции

Функция ОтпрУС(ДанныеДляФормирования)

	ОтпрУС = ПолучитьXDTOОбъект(АнонимныйТип("Файл.Документ.ОтпрУС"));
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ОтпрУС, "ИдОтпрУС", ДанныеДляФормирования.Участники.Отправитель.Идентификатор, Истина);
	Возврат ОтпрУС;
	
КонецФункции

Функция ПолучУС(ДанныеДляФормирования)

	ПолучУС = ПолучитьXDTOОбъект(АнонимныйТип("Файл.Документ.ПолучУС"));                                                                        
	РаботаСФайламиБЭД.ЗаполнитьСвойствоXDTO(ПолучУС, "ИдПолучУС", ДанныеДляФормирования.Участники.Получатель.Абонент.Идентификатор, Истина);
	Возврат ПолучУС;
	
КонецФункции

// Возвращаемое значение:
//  ОбъектXDTO
//
Функция НовыйXDTOОбъект()
	ПространствоИмен = ПространствоИмен();
	Возврат РаботаСФайламиБЭД.ПолучитьОбъектТипаCML("{" + ПространствоИмен + "}.Файл", ПространствоИмен);
КонецФункции

Функция ПолучитьXDTOОбъект(ТипОбъекта)
	Возврат РаботаСФайламиБЭД.ПолучитьОбъектТипаCML(ТипОбъекта, ПространствоИмен());
КонецФункции  

Функция АнонимныйТип(Тип)
	Возврат СтрШаблон("{%1}.%2", ПространствоИмен(), Тип);
КонецФункции     

Функция СоответствиеЭлементаРегламентаТипуУС()
		
	Результат = Новый Соответствие;
	
	СтатусыУС = СтатусыУС();	

	Результат.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.УС_ИОП, СтатусыУС.ИзвещениеОПолучении);
	Результат.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.УС_УОУ, СтатусыУС.УведомлениеОбУточнении);
	Результат.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.УС_ОтказВПодписи, СтатусыУС.ОтказВПодписи);
	Результат.Вставить(Перечисления.ТипыЭлементовРегламентаЭДО.УС_ДополнительнаяИнформация, СтатусыУС.ДополнительнаяИнформация);
	Возврат Результат;
	
КонецФункции

Функция СтатусыУС()
	Результат = Новый Структура;
	Результат.Вставить("ИзвещениеОПолучении", "1999");
	Результат.Вставить("УведомлениеОбУточнении", "2999");
	Результат.Вставить("ОтказВПодписи", "3999");
	Результат.Вставить("ДополнительнаяИнформация", "4002");
	Возврат Результат;
КонецФункции

Процедура Инициализировать()
	
	ДатаФормирования = ТекущаяДатаСеанса();
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

Инициализировать();

#КонецОбласти

#КонецЕсли
